Revit 2026 API

# MechanicalEquipmentSetRemove Method

---
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Remove(
	ISet<ElementId> elemIds
)
```
```vb
Public Sub Remove (
	elemIds As ISet(Of ElementId)
)
```
```cpp
public:
void Remove(
	ISet<ElementId^>^ elemIds
)
```
```fsharp
member Remove :
        elemIds : ISet<ElementId> -> unit
```

#### Parameters

elemIds ISetElementId

#### Reference

MechanicalEquipmentSet Class

Autodesk.Revit.DB.Mechanical Namespace